app/views/collections/index.html.erb

SELECT "cards".* FROM "cards"
---

  <% Card.all.each do |card| %>