app/views/theme_sets/show.html.erb


  <% @theme_set.cards.each do |card| %>
---
SELECT "cards".* FROM "cards" WHERE "cards"."theme_set_id" = ?  [["theme_set_id", 1]]