app/views/users/show.html.erb

SELECT "decks".* FROM "decks" WHERE "decks"."user_id" = ?  [["user_id", 2]]
---
  <h2>Deck List:</h2>
  <% @user.decks.each do |deck| %>