app/views/cards/_card_forms.html.erb

  <%= f.label :theme_set_id, "Theme Set" %>
  <%= f.collection_select(:theme_set_id, ThemeSet.all, :id, :name, include_blank: true) %><br>
---
SELECT "theme_sets".* FROM "theme_sets"