app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def currect_user
    if session[:currect_user_id]
      @user = User.find(session[:currect_user_id])