app/controllers/cards_controller.rb

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def get_card
    @card = Card.find(params[:id])