app/controllers/decks_controller.rb

  def create
    @deck = Deck.new(strong_params)
    if @deck.save
      for temp in 0...params[:deck][:card_ids].size do
---
SELECT "card_decks".* FROM "card_decks" WHERE "card_decks"."card_id" = ?  [["card_id", 1]]
SELECT "decks".* FROM "decks"

  def update
    @deck = Deck.find(params[:id])
    if @deck.update(strong_params)
      CardDeck.all.select{|e| e.deck_id == @deck.id}.each{|e| e.destroy}
      for temp in 0...params[:deck][:card_ids].size do
        CardDeck.create(card_id: params[:deck][:card_ids][temp], deck_id: @deck.id )
---
INSERT INTO "card_decks" ("card_id", "deck_id", "copies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["card_id", 1], ["deck_id", 1], ["copies", 4], ["created_at", "2018-09-11 14:11:22.033165"], ["updated_at", "2018-09-11 14:11:22.033165"]]