app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks" WHERE "decks"."user_id" = ?  [["user_id", 1]]
---
  def index
    if current_user
      @decks = current_user.decks
    else
      @decks = Deck.all

SELECT "card_decks".* FROM "card_decks" WHERE "card_decks"."deck_id" = ?  [["deck_id", 1]]
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @deck = Deck.find(params[:id])

INSERT INTO "card_decks" ("card_id", "deck_id", "copies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["card_id", 1], ["deck_id", 7], ["copies", 0], ["created_at", "2018-09-11 14:25:47.891889"], ["updated_at", "2018-09-11 14:25:47.891889"]]
INSERT INTO "decks" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "idk"], ["user_id", 4], ["created_at", "2018-09-11 14:25:47.866490"], ["updated_at", "2018-09-11 14:25:47.866490"]]
---
  def create
    @deck = Deck.new(strong_params)
    if @deck.save

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @deck = Deck.find(params[:id])

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "decks".* FROM "decks"
DELETE FROM "card_decks" WHERE "card_decks"."id" = ?  [["id", 4]]
SELECT "card_decks".* FROM "card_decks"
---
  def update
    @deck = Deck.find(params[:id])
    if @deck.update(strong_params)
      CardDeck.all.select{|e| e.deck_id == @deck.id}.each{|e| e.destroy}

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 1]]
---
  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy

SELECT "decks".* FROM "decks"
INSERT INTO "card_decks" ("card_id", "deck_id", "copies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["card_id", 1], ["deck_id", 1], ["copies", 3], ["created_at", "2018-09-11 19:16:15.804394"], ["updated_at", "2018-09-11 19:16:15.804394"]]
---
  def create_cards(current_deck)
    user_id = params[:deck][:user_id].to_i
    params[:card_ids].each{|k, v| CardDeck.create(card_id: k.to_i, deck_id: current_deck.id, copies: v.to_i)}