app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]
---
  def create
    #POST /sessions

    @user = User.find_by(username: params["username"])