app/controllers/theme_sets_controller.rb

SELECT "theme_sets".* FROM "theme_sets"
---
  def index
    @theme_sets = ThemeSet.all

INSERT INTO "theme_sets" ("name", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Thunder Lords"], ["category", "Lightning Elementals"], ["created_at", "2018-09-12 15:26:52.526757"], ["updated_at", "2018-09-12 15:26:52.526757"]]
---
  def create
    @theme_set = ThemeSet.create(strong_params)

DELETE FROM "theme_sets" WHERE "theme_sets"."id" = ?  [["id", 1]]
---
  def destroy
    find_theme_set
    @theme_set.destroy

SELECT  "theme_sets".* FROM "theme_sets" WHERE "theme_sets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_theme_set
    @theme_set = ThemeSet.find(params[:id])