app/controllers/users_controller.rb

  def index

    if current_user.nil?
      redirect_to '/'
    else
      if current_user.id == 1
        @users = User.all
---
SELECT "users".* FROM "users"

  def destroy
    @user = User.find(params[:id])
    @user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def buy
    random = rand(1..Card.all.size)
    @thing = []
    if logged_in?
      for i in 0..2
        if found = Collection.find_by(card_id: random, user_id: current_user.id)
          found.increment!(:amount, 1)
        else
          Collection.create(card_id: random, user_id: current_user.id, amount: 1)
---
SELECT COUNT(*) FROM "cards"
SELECT  "collections".* FROM "collections" WHERE "collections"."card_id" = ? AND "collections"."user_id" = ? LIMIT ?  [["card_id", 14], ["user_id", 2], ["LIMIT", 1]]
UPDATE "collections" SET "amount" = COALESCE("amount", 0) + 1 WHERE "collections"."id" = ?  [["id", 1]]
INSERT INTO "collections" ("card_id", "user_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["card_id", 14], ["user_id", 2], ["amount", 1], ["created_at", "2018-09-13 20:48:02.522728"], ["updated_at", "2018-09-13 20:48:02.522728"]]

  def buy_this
    if found = Collection.find_by(card_id: params[:card_id], user_id: current_user.id)
      found.increment!(:amount, 1)
---
SELECT  "collections".* FROM "collections" WHERE "collections"."card_id" = ? AND "collections"."user_id" = ? LIMIT ?  [["card_id", 14], ["user_id", 2], ["LIMIT", 1]]
UPDATE "collections" SET "amount" = COALESCE("amount", 0) + 1 WHERE "collections"."id" = ?  [["id", 1]]