app/models/card_deck.rb

  def self.find_copies(card_id, deck_id)
    found = self.select {|a| a.card_id == card_id and a.deck_id == deck_id}[0]
---
SELECT "card_decks".* FROM "card_decks" WHERE "card_decks"."deck_id" = ?  [["deck_id", 1]]
SELECT "card_decks".* FROM "card_decks" WHERE "card_decks"."card_id" = ?  [["card_id", 1]]