app/views/decks/_form.html.erb

SELECT "users".* FROM "users"
---
  <% else %>
    <%= f.collection_select :user_id, User.all, :id, :username %>

SELECT "cards".* FROM "cards"
SELECT "card_decks".* FROM "card_decks" WHERE "card_decks"."card_id" = ?  [["card_id", 1]]
SELECT "cards"."id" FROM "cards" INNER JOIN "card_decks" ON "cards"."id" = "card_decks"."card_id" WHERE "card_decks"."deck_id" = ?  [["deck_id", 5]]
---

  <% Card.all.each do |card| %>
    <%= label_tag "#{card.name}" %>
    <%= number_field_tag "card_ids[#{card.id}]", card.card_decks.find_copies(card.id, @deck.id), in: 0..10 %>