app/views/decks/show.html.erb

<ul class="mdl-list theme-card-listing">
<% @deck.cards.each do |card| %>
  <% if @deck.card_decks.find_copies(card.id, @deck.id) > 0 %>
---
SELECT "cards".* FROM "cards" INNER JOIN "card_decks" ON "cards"."id" = "card_decks"."card_id" WHERE "card_decks"."deck_id" = ?  [["deck_id", 3]]
SELECT "card_decks".* FROM "card_decks" WHERE "card_decks"."deck_id" = ?  [["deck_id", 1]]